D2/system/pointLocation1.txt
( 19.900 0.000 0.000 )
( 19.981 0.000 0.040 )
( 19.987 0.000 0.129 )
( 19.991 0.000 0.219 )
( 19.993 0.000 0.309 )
( 19.995 0.000 0.400 )
( 19.996 0.000 0.490 )
( 19.997 0.000 0.580 )
( 19.998 0.000 0.670 )
( 19.999 0.000 0.760 )
( 20.000 0.000 0.850 )
