D2/system/pointLocation4.txt
( 20.400 0.900 0.000 )
( 20.319 0.900 0.040 )
( 20.313 0.900 0.129 )
( 20.309 0.900 0.219 )
( 20.307 0.900 0.309 )
( 20.305 0.900 0.400 )
( 20.304 0.900 0.490 )
( 20.303 0.900 0.580 )
( 20.302 0.900 0.670 )
( 20.301 0.900 0.760 )
( 20.300 0.900 0.850 )
